Poinsot_burner_2D/testcase/system/extrudeMeshDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom mesh;
sourceCase "$FOAM_CASE";
sourcePatches (oxidizerInlet);

flipNormals false;

extrudeModel        linearNormal;

nLayers             25;
expansionRatio      1.0;

linearNormalCoeffs
{
    direction       (-1 0 0);
    thickness       0.025;
}

mergeFaces false;

// ************************************************************************* //
