Poinsot_burner_2D/testcase/constant/README
aggiungi chemistryProperties
