Poinsot_burner_2D/testcase/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

correction
{
    type            DTFLESEnergyCorrection;
    select          all;
}

fixedPower
{
    type            heatSource;
    select          cellSet;
    cellSet         heatSourceSet;

    Q               table
    (
        (0.03        0)
        (0.035       110)
        (0.04        0)
        (10.0        0)
    );          // Set power (W)
}


//************************************************************************** //
