Poinsot_burner_2D/testcase/constant/particlePosition.txt
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
    (0.0001 0.001 0.0005)
    (0.0001 0.00265517 0.0005)
    (0.0001 0.00431034 0.0005)
    (0.0001 0.00596552 0.0005)
    (0.0001 0.00762069 0.0005)
    (0.0001 0.00927586 0.0005)
    (0.0001 0.01093103 0.0005)
    (0.0001 0.01258621 0.0005)
    (0.0001 0.01424138 0.0005)
    (0.0001 0.01589655 0.0005)
    (0.0001 0.01755172 0.0005)
    (0.0001 0.0192069 0.0005)
    (0.0001 0.02086207 0.0005)
    (0.0001 0.02251724 0.0005)
    (0.0001 0.02417241 0.0005)
    (0.0001 0.02582759 0.0005)
    (0.0001 0.02748276 0.0005)
    (0.0001 0.02913793 0.0005)
    (0.0001 0.0307931 0.0005)
    (0.0001 0.03244828 0.0005)
    (0.0001 0.03410345 0.0005)
    (0.0001 0.03575862 0.0005)
    (0.0001 0.03741379 0.0005)
    (0.0001 0.03906897 0.0005)
    (0.0001 0.04072414 0.0005)
    (0.0001 0.04237931 0.0005)
    (0.0001 0.04403448 0.0005)
    (0.0001 0.04568966 0.0005)
    (0.0001 0.04734483 0.0005)
    (0.0001 0.049 0.0005)
);
