Poinsot_burner_2D/testcase/constant/particlePosition_air_entry.txt
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
    (-0.025000 0.000000 0.000500)
    (-0.025000 0.000784 0.000500)
    (-0.025000 0.001572 0.000500)
    (-0.025000 0.002356 0.000500)
    (-0.025000 0.003144 0.000500)
    (-0.025000 0.003928 0.000500)
    (-0.025000 0.004712 0.000500)
    (-0.025000 0.005500 0.000500)
    (-0.025000 0.006284 0.000500)
    (-0.025000 0.007072 0.000500)
    (-0.025000 0.007856 0.000500)
    (-0.025000 0.008644 0.000500)
    (-0.025000 0.009428 0.000500)
    (-0.025000 0.010212 0.000500)
    (-0.025000 0.011000 0.000500)
    (-0.025000 0.018000 0.000500)
    (-0.025000 0.018502 0.000500)
    (-0.025000 0.019000 0.000500)
    (-0.025000 0.019499 0.000500)
    (-0.025000 0.020001 0.000500)
    (-0.025000 0.020500 0.000500)
    (-0.025000 0.021001 0.000500)
    (-0.025000 0.021500 0.000500)
    (-0.025000 0.022002 0.000500)
    (-0.025000 0.022500 0.000500)
    (-0.025000 0.022999 0.000500)
    (-0.025000 0.023501 0.000500)
    (-0.025000 0.024000 0.000500)
    (-0.025000 0.024501 0.000500)
    (-0.025000 0.025000 0.000500)
);
