Poinsot_burner_2D/testcase/constant/particlePosition_fuel_entry.txt
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
    (-0.025000 0.012000 0.000500)
    (-0.025000 0.012172 0.000500)
    (-0.025000 0.012345 0.000500)
    (-0.025000 0.012517 0.000500)
    (-0.025000 0.012690 0.000500)
    (-0.025000 0.012862 0.000500)
    (-0.025000 0.013034 0.000500)
    (-0.025000 0.013207 0.000500)
    (-0.025000 0.013379 0.000500)
    (-0.025000 0.013552 0.000500)
    (-0.025000 0.013724 0.000500)
    (-0.025000 0.013897 0.000500)
    (-0.025000 0.014069 0.000500)
    (-0.025000 0.014241 0.000500)
    (-0.025000 0.014414 0.000500)
    (-0.025000 0.014586 0.000500)
    (-0.025000 0.014759 0.000500)
    (-0.025000 0.014931 0.000500)
    (-0.025000 0.015103 0.000500)
    (-0.025000 0.015276 0.000500)
    (-0.025000 0.015448 0.000500)
    (-0.025000 0.015621 0.000500)
    (-0.025000 0.015793 0.000500)
    (-0.025000 0.015966 0.000500)
    (-0.025000 0.016138 0.000500)
    (-0.025000 0.016310 0.000500)
    (-0.025000 0.016483 0.000500)
    (-0.025000 0.016655 0.000500)
    (-0.025000 0.016828 0.000500)
    (-0.025000 0.017000 0.000500)
);
