Poinsot_burner_2D/testcase/constant/particlePosition_fuel_update.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
    (-0.025000 0.012000 0.000500)
    (-0.025000 0.012714 0.000500)
    (-0.025000 0.013429 0.000500)
    (-0.025000 0.014143 0.000500)
    (-0.025000 0.014857 0.000500)
    (-0.025000 0.015571 0.000500)
    (-0.025000 0.016286 0.000500)
    (-0.025000 0.017000 0.000500)
);
