Poinsot_burner_2D/testcase/constant/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LES
{
    model           nonUnityLewisEddyDiffusivity;

    Prt             0.7;
    Sct             0.21; //the practical limitation should say 0.5
    //Let = 0.35 = Sct/Prt (we are limited by practical reasons)
}


// ************************************************************************* //
