Poinsot_burner_2D/testcase/0.anchored/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    "(inletWall|top)"
    {
        type            noSlip;
    }

    fuelInlet
    {
        type            fixedValue;
        value           uniform (0.6 0 0);
    }

    oxidizerInlet
    {
        type            fixedValue;
        value           uniform (13.0 0 0);
    }

    bottom
    {
        type            symmetry;
    }   
    
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
