Poinsot_burner_2D/testcase/0.anchored/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            waveTransmissive;
        gamma		1.4;
        fieldInf	101325;
        lInf		10;
        value           $internalField;
    }

    "(fuelInlet|oxidizerInlet|inletWall|top)"
    {
        type             zeroGradient;
       
    }

    bottom
    {
        type            symmetry;
    }   

    sides
    {
        type            empty;
    }

}


// ************************************************************************* //
