Poinsot_burner_2D/testcase/0.anchored/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inletWall|top)"
    {
        type            nutkWallFunction;
        value		$internalField;
    }


    "(outlet|fuelInlet|oxidizerInlet)"
    {
        type            calculated;
        value		$internalField;
    }

    bottom
    {
        type            symmetry;
    }   

    sides
    {
        type            empty;
    }

}


// ************************************************************************* //
